rails-todo/app/controllers/todos_controller.rb

  def index
    # @todos = Todo.find(:all)
    @todos = Todo.all
---
SELECT `todos`.* FROM `todos`